Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh99-v2.tmx
Source language: bo
Languages: en

source: མཽད་གལ་གྱི་བུ་དེ་ཇི་སྙམ་དུ་སེམས། དེའི་ཚེ་དེའི་དུས་ན་བདུད་ཤུགས་འཆང་ཞེས་བྱ་བར་གྱུར་བ་དེ་གཞན་ཡིན་པར་སེམས་ན་ཁྱོད་ཀྱིས་དེ་ལྟར་མི་བལྟ་སྟེང་དེར་གྱུར་ཏོ། །
en: “Maudgalyāyana, in case you may think that at that time the māra Vegadharin was anyone else, do not think so. In those days I was the māra Vegadharin.

source: མཽད་གལ་གྱི་བུ་དེ་ལྟ་བས་ན་བྱང་ཆུབ་སེམས་དཔའ་ངན་སོང་སྤོང་བར་འདོད་ཅིང་། སེམས་ཅན་གྱི་དོན་བྱ་བར་འདོད་པས་མདུད་པར་གཟུང་བར་མི་བྱའོ། །
en: Therefore, Maudgalyāyana, bodhisattvas who wish to leave the lower realms behind and act for the benefit of beings should not harbor any malice.

source: མཽད་གལ་གྱི་བུ་ངས་བརྩོན་འགྲུས་ཤེས་པ་འགོག་པར་འགྱུར་བའི་ལམ་ཤེས་པར་བྱ་བའི་དོན་ནས་དེ་བཞིན་དུ་སྦྱར་ཏེ། མངོན་པར་འདུས་བྱས་པའི་བར་དུའོ། །
en: “Maudgalyāyana, when I was training in the practices of a bodhisattva in the past, I created boundless roots of virtue in order to understand the path that leads to cessation as related to knowledge of diligence.

source: མཽད་གལ་གྱི་བུ་སྔོན་བྱུང་བ་འདས་པའི་དུས་ནས། འཁོར་བ་བརྗོད་དུ་མེད་པ་དེའི་ཕ་རོལ་གྱི་ཡང་ཆེས་ཕ་རོལ་ན་རྒྱལ་པོ་དངོས་པོར་ངེས་པར་འཛིན་པ་ཞེས་བྱ་བ་ཆོས་ཀྱི་རྒྱལ་པོ་ཆོས་དང་ལྡན་པ་ཞིག་བྱུང་ངོ་། །
en: “Long ago in the limitless cycle of existence, Maudgalyāyana, long before even the distant past there was a religious and righteous king called Determiner of Things.

source: དངོས་པོ་ཐམས་ཅད་ལ་ངེས་པ་འདི་སྐད་སྨྲ། འདི་ལྟར་བལྟ་སྟེ། ཇི་ལྟར་དངོས་པོ་གང་གིས་བྱ་བ་དེ་དེ་ལྟར་གྱུར་ཏེ། གཞན་དུ་མ་ཡིན་ནོ། །
en: This king would make declarations about all things, determining them to be in exactly one way, and not any other.

source: དེའི་བློན་པོ་ཆོས་ལ་སྤྱོད་པ་ཞེས་བྱ་བ། མཛངས་ཤིང་དཔྱོད་པ་བྱ་བ་དང་། བྱ་བ་མ་ཡིན་པ་ལ་མཁས་པ། རྒྱལ་སྲིད་ཡོངས་སུ་སྐྱོང་བ།
en: The king had a wise minister called Dharmacārin, who was an expert in the ways of analysis and who sustained the kingdom.

source: དེ་བཞིན་གཤེགས་པ་དཔག་ཏུ་མེད་པ་ལ་བསྙེན་བཀུར་བྱས་པ། དགེ་བའི་རྩ་བ་དཔག་ཏུ་མེད་པ་བྱས་པ། ཐེག་པ་ཆེན་པོ་ལ་ཡང་དག་པར་རབ་ཏུ་གནས་པ་ཞིག་བྱུང་ངོ་། །
en: This minister had served boundless thus-gone ones, created boundless roots of virtue, and was firmly established within the Great Vehicle.

source: དེ་རྒྱལ་པོ་དངོས་པོར་ངེས་པར་འཛིན་པ་དེ་ལྟ་བར་གྱུར་པ་དེ་ལས་འབྲལ་བར་འདོད་ནས་དེས་གསེར་གྱི་སྣོད་དག་བྱེད་དུ་བཅུག་སྟེ།
en: “Wishing to free King Determiner of Things of his views, the minister at one point had a number of golden jars made.

source: ཏིལ་མར་གྱི་སྣོད་དང་། མར་གྱི་སྣོད་དང་། ཁ་རའི་སྣོད་དང་། བཏུང་བའི་སྣོད་དང་། བཟའ་བའི་སྣོད་དེ་རིན་པོ་ཆེའི་སྣོད་ཀྱི་རྣམ་པ་དེ་དང་དེ་དག་བྱེད་དུ་བཅུག་སྟེ
en: There was one jar for sesame oil, another for butter, another again for sugar, and one jar for drink, and one for food. He also had similar jars made out of different precious substances.

source: དེ་སྣོད་དེ་དག་བྱས་ནས་རྒྱལ་པོ་དངོས་པོར་ངེས་པར་འཛིན་པ་དེ་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །
en: Presenting the precious jars to the king, the minister asked,

source: རྒྱལ་པོ་ཆེན་པོ་སྣོད་འདི་དག་གང་གི་སྣོད་དུ་ངེས་ལགས།
en: ‘Your Majesty, to what foods do these jars belong?’

source: དེས་སྨྲས་པ་གྲོང་གི་གཙོ་བོ་སྣོད་འདི་དག་གང་གིར་རུང་བ་ཁྱོད་བདག་ཉིད་ཀྱིས་ཤེས་པར་གྱིས་ཤིག །
en: “ ‘Chief of the city,’ replied the king, ‘let me tell you what kinds of jars these are.

source: འདི་ནི་རེ་ཤིག་ཆུའི་སྣོད་དུ་ངེས་སོ། །འདི་ནི་ཏིལ་མར་གྱི་སྣོད་དུ་ངེས་སོ། །
en: Here is a water jug, and that one is for sesame oil.

source: འདི་ནི་མར་སར་གྱི་སྣོད་དུ་ངེས་སོ། །འདི་ནི་སྦྲང་རྩིའི་སྣོད་དོ། །
en: This one is a butter jar, and that one is for honey.

source: འདི་ནི་བཏུང་བའི་སྣོད་དོ། །འདི་ནི་བཟའ་བའི་སྣོད་དོ། །
en: This jar is for food and that one for drink.

source: འདི་ནི་གསེར་གྱི་སྣོད་དོ། །འདི་ནི་དངུལ་གྱི་སྣོད་དེ།
en: These are golden jars and those are of silver.’

source: སྣོད་དེ་དག་ཐམས་ཅད་ནི་ངེས་པར་བསྟན་པ་ཡིན་ནོ། །
en: Thus the king identified all the jars.

source: དེ་ནས་བློན་པོ་དེས་སྣོད་དེ་དག་ཐམས་ཅད་བརྗེས་ཏེ། ཏིལ་མར་གྱི་སྣོད་དུ་མར་བླུགས། མར་གྱི་སྣོད་དུ་ཏིལ་མར་བླུགས།
en: “Now the minister exchanged the jars, and so he poured butter into the jar that had contained sesame oil, and sesame oil into the butter jar.

source: སྦྲང་རྩིའི་སྣོད་དུ་བཏུང་བ་བླུགས། བཏུང་བའི་སྣོད་དུ་སྦྲང་རྩི་བླུགས་ཏེ།
en: He poured drink into the honey jar and honey into the jar for drinking.

source: ཐབས་དེས་སྣོད་དེ་དག་ཐམས་ཅད་བརྗེས་སོ། །
en: In that way he changed all the jars around.

source: དེ་ནས་བློན་པོ་དེས་སྣོད་དེ་དག་ཐམས་ཅད་བརྗེས་ནས་རྒྱལ་པོ་དེ་གདུགས་ཚོད་ལ་སྤྱན་དྲངས་ཏེ་བཞུགས་ནས་རིམ་གྲོ་པ་ལ་སྨྲས་པ།
en: He then invited the king for lunch, and when the king had arrived he told the servants,

source: གྲོགས་པོ་བཀྲུ་བཤལ་གྱི་ཆུ་སྣོད་ནས་ཆུ་ཁྱེར་ཏེ་ཤོག །
en: ‘Friends, bring us some water from the washbasin.

source: བཀྲུ་བཤལ་བྱ་ཡིས་ཆུ་ཉུང་ངུ་ཞིག་ཁྱེར་ཏེ་ཤོག །
en: We wish to wash our hands, so please bring a bit of water.’

source: ཅེས་ཇི་སྐད་བསྒོ་བ་བཞིན་སྣོད་བཀང་སྟེ་ཕུལ་ལོ། །
en: The servants did as instructed and so they offered a jar full of water.

source: དེ་ནས་རྒྱལ་པོ་དངོས་པོར་ངེས་པར་འཛིན་པ་དེ་སྣོད་དེ་དག་བཀང་བ་མཐོང་ནས། བློན་པོ་དེ་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །
en: When King Determiner of Things now saw all the full vessels, he exclaimed to his minister,

source: གྲོང་གི་གཙོ་བོ་སྣོད་བྱས་པ་འདི་དག་ཆུད་མ་ཟོས་སམ།
en: ‘Chief of the city, have all these jars not gone to waste?

source: གང་ཆུ་སྣོད་དུ་མར་བླུགས།
en: The water jar is full of butter.

source: དེ་བཞིན་དུ་སྒྱུ་མར་བྱས་པའི་ཆོས་ཐམས་ཅད་ཆུད་མ་ཟོས་སམ།
en: Likewise, do not all illusory things in this way go to waste?’

source: དེས་སྨྲས་པ། ཇི་ལྟར་སྣོད་ཀྱི་རྣམ་པ་འདི་དག་ཆབ་འཚལ་བ་དེ་བཞིན་དུ་དངོས་པོ་ཐམས་ཅད་རྣམ་པར་འཇིག་པའི་མཐའ་ལགས་ཏེ།
en: “ ‘All things come to an end,’ replied the minister, ‘just as these jars have all lost their previous features.

source: དངོས་པོ་གང་ཡང་ངེས་པ་མ་མཆིས་སོ། །
en: There is no certainty about anything.

source: དངོས་པོ་ཐམས་ཅད་ནི་རྣམ་པར་འཇིག་པའི་མཐའ་ལགས་ཤིང་།
en: All entities undergo destruction.

source: ཡོངས་སུ་འགྱུར་བའི་མཐའ་ལགས་སོ། །
en: All things change.

source: དངོས་པོ་ཐམས་ཅད་ནི་མི་རྟག་པ་ཉིད་ཀྱི་མཚན་ཉིད་ཀྱིས་རྣམ་པར་འཇིག་པའི་ཆོས་ཅན་ལགས་སོ། །
en: Characterized by impermanence, all things are subject to destruction.

source: དངོས་པོ་ཐམས་ཅད་ནི་ཡོངས་སུ་འགྱུར་བའི་མཚན་ཉིད་ཀྱིས་གཞན་དུ་གྱུར་ཏེ
en: Characterized by change, they turn into something else.

source: དངོས་པོ་གང་ཡང་རྟག་པ་མ་ལགས། དངོས་པོ་གང་ཡང་ངེས་པ་མ་ལགས་ལ།
en: No thing lasts and nothing is certain about anything.

source: གཞན་དུ་མཐོང་ཞིང་གཞན་དུ་འགྱུར་ལགས་སོ། །
en: We see things differently and things change.

source: རྒྱལ་པོ་ཆེན་པོ་དེ་ལྟ་ལགས་པས་མི་རྟག་པའི་དངོས་པོ་ལ་མི་རྟག་པའི་འདུ་ཤེས་བསྒོམ་པར་བགྱི།
en: Therefore, great king, train yourself in recognizing the impermanence of all impermanent things.

source: ངེས་པ་མ་མཆིས་པའི་དངོས་པོ་ལ་གཡོ་བའི་འདུ་ཤེས་བསྒོམ་པར་བགྱིའོ། །
en: Train yourself in recognizing how all these uncertain things are in movement.

source: རྒྱལ་པོ་ཆེན་པོ་གཞན་ཡང་དར་ལ་བབ་པ་ནི་རྒས་པར་འགྱུར།
en: Moreover, Your Majesty, youth becomes old age.

source: གཞོན་ནུ་ནི་བར་མར་འགྱུར།
en: The youth grows up,

source: བར་མ་ནི་རྒས་པར་འགྱུར།
en: the grownup ages,

source: རྒས་པ་ཡང་འགུམ་པར་གདའ་ལགས་ཏེ།
en: and the old person succumbs.

source: དེ་ལྟ་ལགས་པས་དངོས་པོ་ཐམས་ཅད་ལ་ངེས་པར་མ་མཆིས་ལགས་སོ། །
en: Hence, no thing is certain.’

source: དེ་ནས་རྒྱལ་པོ་དངོས་པོར་འཛིན་པ་དེ། བློན་པོ་དེས་གཞི་དེ་འདོར་དུ་བཅུག་གོ། །
en: “In this way the minister was able to change King Determiner of Things’ outlook.

source: དེས་བློན་པོ་དེ་ལ་སྨྲས་པ། གྲོང་གི་གཙོ་བོ་ལེགས་སོ་ལེགས་སོ། །
en: ‘Chief of the city,’ responded the king, ‘well said, well said!

source: ཤེས་པ་འདི་རྟོགས་པར་བྱ་བའི་ཕྱིར་འབད་པར་བྱའོ། །
en: I shall endeavor to realize this knowledge.’

source: མཽད་གལ་གྱི་བུ་དེ་ཇི་སྙམ་དུ་སེམས། དེའི་ཚེ་དེའི་དུས་ན་བློན་པོ་ཆོས་སྤྱོད་ཅེས་བྱ་བར་གྱུར་པ་དེ་གཞན་ཡིན་པར་སེམས་ན་ཁྱོད་ཀྱིས་དེ་ལྟར་མི་བལྟ་སྟེ
en: “Maudgalyāyana, in case you may think that at that time the minister Dharmacārin was anyone else, do not think so.

source: ང་དེའི་ཚེ་དེའི་དུས་ན་བློན་པོ་ཆོས་སྤྱོད་ཅེས་བྱ་བར་གྱུར་ཏོ། །
en: In those days I was the minister Dharmacārin.

source: མཽད་གལ་གྱི་བུ་དེ་ལྟ་བས་ན་བྱང་ཆུབ་སེམས་དཔས་དངོས་པོ་ཐམས་ཅད་ལ་ངེས་པ་མེད་པར་བྱ།
en: Therefore, Maudgalyāyana, bodhisattvas must recognize that no thing is certain.

source: བརྩོན་འགྲུས་ཀྱི་སྟོབས་ཀྱི་རིམ་པ་རྟོགས་པས་བྱ་བ་ལ་ལྕི་བ་དང་ཡང་བར་འགྱུར་རོ། །
en: As they gradually comprehend the power of diligence their deeds will become weighty.”

source: མཽད་གལ་གྱི་བུ་ངས་རིམ་པ་ཤེས་པར་བྱ་བའི་དོན་དུ་སྔོན་བྱང་ཆུབ་སེམས་དཔའི་སྤྱད་པ་སྤྱོད་པ་ན། བདག་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་ནས། རིམ་པ་ཤེས་པས་སེམས་ཅན་རྣམས་ལ་ཇི་ལྟར་ཡང་དག་པར་རབ་ཏུ་བསྟན་པར་བྱ། བདག་གིས་སེམས་ཅན་དག་རིམ་པ་ཤེས་པ་ལ་ཇི་ལྟར་རབ་ཏུ་དགོད། དགེ་བ་དང་མི་དགེ་བའི་ཆོས་ཀྱི་ཁྱད་པར་དག་ལ་མཁས་པ་དང་། ཡེ་ཤེས་ཀྱི་ཁྱད་པར་དག་ལ་མཁས་པར་གྱུར་སྙམ་ནས། དགེ་བའི་རྩ་བ་རྣམ་པ་སྣ་ཚོགས་དུ་མ་དག་མངོན་པར་འདུས་བྱས་སོ། །
en: “Maudgalyāyana, when I was training in the practices of a bodhisattva in the past, I created numerous different roots of virtue in order to understand the levels. I did this by wondering, ‘How can I fully awaken to unsurpassed and perfect buddhahood and then teach sentient beings through knowledge of the levels. How may I instill knowledge of the levels in sentient beings? I must become an expert on the distinction between virtuous and unvirtuous qualities and on the special features of wisdom.’

source: མཽད་གལ་གྱི་བུ་སྔོན་བྱུང་བ་འདས་པའི་དུས་ནས། དེའི་ཕ་རོལ་གྱི་ཡང་ཆེས་ཕ་རོལ་ན། རྒྱལ་པོ་ཀུན་ཏུ་གོ་བྱེད་ཅེས་བྱ་བ་ཞིག་བྱུང་སྟེ། དེ་རྒྱལ་སྲིད་ཐོབ་ནས་བག་ཡོད་པས་རྒྱལ་སྲིད་བྱེད་དོ། །
en: “Long ago in the limitless cycle of existence, Maudgalyāyana, long before even the distant past there was a king known as Instiller of Understanding who, upon ascending the throne, ruled his realm with great care.

source: དེའི་བཙུན་མོ་བུད་མེད་ཁྲི་ཕྲག་བརྒྱད་བྱུང་སྟེ། གཟུགས་བཟང་ཞིང་མཛེས་པ། བལྟ་ན་སྡུག་པ། ཁ་དོག་བཟང་པོ་རྒྱས་པ། མཆོག་དང་ལྡན་པ།
en: The king had eighty thousand queens, all of them beauties of fine physique, delightful to behold, of fine complexion, and supreme in all regards.

source: སྔར་ལྡང་ཞིང་ཕྱིས་ཉལ་བ། དེ་དག་གི་གཟུགས་ནི་ལྷ་མོ་དང་འདྲ། ཡོན་ཏན་ནི་འདོད་ཆགས་དང་བྲལ་བ་དང་འདྲའོ། །
en: They all rose early and fell asleep late. Their physical forms were like those of goddesses and their qualities resembled those of a being who is free from desire.

source: དེ་ནས་རྒྱལ་པོ་ཀུན་ཏུ་གོ་བྱེད་བུད་མེད་ཁྲི་ཕྲག་བརྒྱད་པོ་དེ་དག་གི་དབུས་སུ་འདུག་ནས་དེ་ལྟ་བུའི་ཏིང་ངེ་འཛིན་ལ་སྙོམས་པར་ཞུགས་སོ། །
en: “Seated in the center of his gathering of eighty thousand ladies, King Instiller of Understanding would enter absorption.

source: ཇི་ལྟར་སེམས་མཉམ་པར་བཞག་པས། བསམ་གཏན་གྱི་བྱེ་བྲག་དང་། ཉོན་མོངས་པའི་བྱེ་བྲག་དང་། ཡོན་ཏན་གྱི་བྱེ་བྲག་དག་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་ཤེས་སོ། །
en: Thus, through his mental equipoise, he came to comprehend numerous concentrations, afflictions, and qualities, just as they are.

source: བུད་མེད་ཀྱི་ཚོགས་འདི་རེ་ཤིག་འདི་དག་ནི་ཤེས་པའི་བྱེ་བྲག། འདི་དག་ནི་ཉོན་མོངས་པའི་བྱེ་བྲག། འདི་དག་ནི་ཡོན་ཏན་གྱི་བྱེ་བྲག །
en: As for the host of ladies, they all had different forms of understanding, affliction, and qualities.

source: དེ་བུད་མེད་ཀྱི་ནང་དུ་འདུག་ནས། ཡུན་མི་རིང་བར་བུད་མེད་ཁྲི་ཕྲག་བརྒྱད་པོ་དག་ཡོངས་སུ་ཤེས་སོ། །
en: Seated in their midst, the king before long comprehended all the ladies’ different constitutions.

source: དེ་བུད་མེད་གང་དག་གི་ལུས་ཤེས་པ་ཉམ་ཆུང་ཞིང་ཉོན་མོངས་པའི་སྟོབས་དང་ལྡན་པ། དེའི་ཉོན་མོངས་པ་རྣམ་པར་གདུལ་བའི་ཕྱིར་ཤེས་པ་སྐྱེད་པའི་ཆོས་སྟོན་ཏོ། །
en: Thus, to those who had meager knowledge of the body and powerful afflictions the king would teach a dharma that produced knowledge in order to tame their afflictions.

source: བུད་མེད་གང་དག་ཉོན་མོངས་པའི་སྟོབས་ཆུང་ལ། ཤེས་པའི་སྟོབས་དང་ལྡན་པ། དེའི་ཉོན་མོངས་པ་ཆུང་ངུ་ཇི་ཙམ་ཡོད་པ་སྤང་བའི་ཕྱིར་ཆོས་བསྟན་ཏེ།
en: For those whose afflictions were weak and understanding strong he would teach a dharma that would enable them to abandon whichever minor afflictions they had.

source: བུད་མེད་འདོད་ཆགས་སྤྱོད་པ་དག་ལ་མི་གཙང་བ་དང་། མི་རྟག་པ་བསྟན།
en: To the women involved in desire he would explain about the unclean and impermanent aspects of things.

source: ཞེ་སྡང་སྤྱོད་པ་དག་ལ་བྱམས་པ་དང་། མི་རྟག་པ་བསྟན།
en: To those involved in anger he would teach love and impermanence.

source: གཏི་མུག་སྤྱོད་པ་དག་ལ་རྟེན་ཅིང་འབྲེལ་བར་འབྱུང་བ་དང་། མི་རྟག་པ་བསྟན།
en: To those involved in stupidity he would teach dependent origination and impermanence.

source: རྣམ་པར་རྟོག་པ་སྤྱོད་པ་དག་ལ་དབུགས་འབྱུང་བ་དང་རྔུབ་པ་དྲན་པ་དང་། མི་རྟག་པ་བསྟན།
en: To those involved in conceptuality he would teach the inhalation and exhalation of the breath as well as impermanence.

source: མཚན་མ་སྤྱོད་པ་དག་ལ་མཚན་མ་མེད་པ་དང་། མི་རྟག་པ་བསྟན།
en: To those involved in marks he would teach absence of marks and impermanence.

source: བུད་མེད་བདག་ཏུ་མངོན་པར་ཞེན་པ་དག་ལ་སྟོང་པ་ཉིད་དང་། མི་རྟག་པ་བསྟན།
en: To those involved in craving he would teach dependent emptiness and impermanence.

source: བུད་མེད་སྲིད་པ་ལ་སྲེད་པ་དག་ལ་སྨོན་པ་མེད་པ་དང་། མི་རྟག་པ་བསྟན་ཏེ།
en: To those women who craved for existence he would teach absence of wishes and impermanence.

source: དེ་ལྟར་ཉོན་མོངས་པ་གང་དང་གང་སྤྱོད་པར་འགྱུར་བ་དེ་དང་དེ་དག་གི་གཉེན་པོས་གཅོད་དོ། །
en: “In this way the ladies all became able to cut through their particular afflictions by means of their specific remedies.

source: དེའི་བུད་མེད་གང་དག་འདོད་ཆགས་སྤྱོད་པ་དེ་དག་བསམ་གཏན་བསྒྲུབས་ཏེ། ཚངས་པའི་ལམ་བསྒོམས་ནས་ཚངས་པའི་འཇིག་རྟེན་དུ་སྐྱེས་སོ། །
en: The women who had been involved in desire thus accomplished concentration, and by practicing the path of Brahmā they were born in the world of Brahmā.

source: བུད་མེད་ཞེ་སྡང་སྤྱོད་པ་དག་ལ་ཚད་མེད་པ་བསྒྲུབས་ཏེ། ཚངས་པའི་ལམ་བསྟན་ཏོ། །
en: Those who had been involved in anger practiced the immeasureables and were thus taught the path of Brahmā.

source: དེའི་བུད་མེད་དེ་དག་ཚད་མེད་པ་ལ་གནས་ཏེ། ཚངས་པའི་ལམ་བསྒོམས་ནས་ཚངས་པའི་འཇིག་རྟེན་དུ་སྐྱེས་སོ། །
en: Abiding within the immeasurables they cultivated the path of Brahmā and were born into the world of Brahmā.

source: བུད་མེད་གང་དག་མཚན་མ་ལ་སྤྱོད་པ་དེ་དག་མཚན་མ་མེད་པ་བསྒྲུབས་ཏེ། ཚངས་པའི་ལམ་བསྟན་ཏོ། །
en: The women who had been involved in marks practiced the absence of marks and were thus taught the path of Brahmā.

source: དེའི་བུད་མེད་དེ་དག་མཚན་མ་མེད་པ་བསྒྲུབས་ཏེ། ཚངས་པའི་ལམ་བསྒོམས་ནས་མཐོ་རིས་ཀྱི་འཇིག་རྟེན་དུ་སྐྱེས་སོ། །
en: Accomplishing the absence of marks they cultivated the path of Brahmā and were reborn in the higher realms.

source: བུད་མེད་གང་དག་སྲིད་པའི་འདོད་ཆགས་ལ་ལྷག་པར་ཆགས་པ་དེ་དག་ལ་སྨོན་པ་མེད་པ་བསྒྲུབས་ཏེ་ཚངས་པའི་ལམ་བསྟན་ཏོ། །
en: Those women who had been particularly attached to the desires of existence accomplished the absence of wishes, and were thus taught the path of Brahmā.

source: དེའི་བུད་མེད་དེ་དག་སྨོན་པ་མེད་པ་བསྒྲུབས་ཏེ། ཚངས་པའི་ལམ་བསྒོམས་ནས་ཚངས་པའི་འཇིག་རྟེན་དུ་སྐྱེས་སོ། །
en: Accomplishing the absence of wishes, they cultivated the path of Brahmā and were reborn in the realm of Brahmā.

source: དེ་ལྟར་རྒྱལ་པོ་ཀུན་ཏུ་གོ་བྱེད་དེས་ཤེས་པ་དང་ཉོན་མོངས་པ་དང་། ཡོན་ཏན་གྱི་ལས་དག་ཡང་དག་པར་རབ་ཏུ་བསྟན་པ་ན་བུད་མེད་ཁྲི་ཕྲག་བརྒྱད་པོ་དེ་དག་
en: In this way King Instiller of Understanding correctly pointed out the different acts related to understanding, affliction, and qualities to the eighty thousand ladies.

source: འདོད་ཆགས་དང་བྲལ་བ་དག་ལ་རབ་ཏུ་བཙུད་ནས་ཚངས་པའི་འཇིག་རྟེན་དུ་སྐྱེས་སོ། །
en: Thus, he led them all to become free from affliction, so that they were reborn in the realm of Brahmā.

source: མཽད་གལ་གྱི་བུ་དེ་ཇི་སྙམ་དུ་སེམས། དེའི་ཚེ་དེའི་དུས་ན་རྒྱལ་པོ་ཀུན་ཏུ་གོ་བྱེད་ཅེས་བྱ་བར་གྱུར་པ་དེ་གཞན་ཡིན་པར་སེམས་ན་ཁྱོད་ཀྱིས་དེ་ལྟར་མི་བལྟ་སྟེ
en: “Maudgalyāyana, in case you may think that at that time King Instiller of Understanding was anyone else, do not think so.

source: ང་དེའི་ཚེ་དེའི་དུས་ན། རྒྱལ་པོ་ཀུན་ཏུ་གོ་བྱེད་ཅེས་བྱ་བར་གྱུར་ཏོ། །
en: In those days I was King Instiller of Understanding.

source: ཤེས་པ་ཐ་མ་དང་འབྲིང་གི་བྱེ་བྲག་ལ་མཁས། ཉོན་མོངས་པ་ཐམ་དང་འབྲིང་དག་གི་བྱེ་བྲག་ལ་མཁས་ཡོན་ཏན་ཐ་མ་དང་འབྲིང་དག་གི་བྱེ་བྲག་དག་ལ་མཁས་སོ། །
en: I was an expert concerning the distinctions between lesser and medium understanding, lesser and medium afflictions, and lesser and medium qualities.

source: མཽད་གལ་གྱི་བུ་དེ་ལྟ་བས་ན། བྱང་ཆུབ་སེམས་དཔས་ཆོས་ཐམས་ཅད་ཀྱི་ཐ་མ་དང་འབྲིང་ལ་མཁས་པར་བྱའོ། །
en: Therefore, Maudgalyāyana, bodhisattvas must understand what is lesser and medium with respect to all phenomena.

source: མཽད་གལ་གྱི་བུ་ངས་རིམ་པ་ཤེས་པ་ཀུན་འབྱུང་བ་ཤེས་པར་བྱ་བའི་དོན་དུ་སྔོན་བྱང་ཆུབ་སེམས་དཔའི་སྤྱད་པ་སྤྱོད་པ་ན། བདག་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་ནས་རིམ་པ་ཤེས་པ་ཀུན་འབྱུང་བ་ཤེས་པ་སེམས་ཅན་རྣམས་ལ་ཇི་ལྟར་ཡང་དག་པར་རབ་ཏུ་བསྟན་པར་བྱ་སྙམ་ནསདགེ་བའི་རྩ་བ་སྣ་ཚོགས་དཔག་ཏུ་མེད་པ་དག་མངོན་པར་འདུས་བྱས་སོ། །
en: “Maudgalyāyana, when I was training in the practices of a bodhisattva in the past, I created boundless roots of virtue in order to understand the origin as related to knowledge of the levels. I did this by wondering how I could fully awaken to unsurpassed and perfect buddhahood and then teach sentient beings about the knowledge of the origin as related to knowledge of the levels.

source: མཽད་གལ་གྱི་བུ་སྔོན་བྱུང་བ་འདས་པའི་དུས་འཁོར་བ་དཔག་ཏུ་མེད་པ་ནས། དེའི་ཕ་རོལ་གྱི་ཡང་ཆེས་ཕ་རོལ་ན། རྒྱལ་པོ་ཉོན་མོངས་པ་སྨོད་པ་ཞེས་བྱ་བ་ཞིག་བྱུང་ངོ་། །
en: “Long ago in the limitless cycle of existence, Maudgalyāyana, long before even the distant past there was a king known as Condemner of the Afflictions.

source: རྒྱལ་པོ་ཉོན་མོངས་པ་སྨོད་པ་དེའི་བཙུན་མོ་བུད་མེད་ཁྲི་ཕྲག་དགུ་བཅུ་བྱུང་སྟེ། གཟུགས་བཟང་ཞིང་མཛེས་པ་བལྟ་ན་སྡུག་པ། ཁ་དོག་བཟང་པོ་རྒྱས་པ་མཆོག་དང་ལྡན་པ་ཡིན་ནོ། །
en: The king had nine hundred thousand queens, all of them beauties of fine physique, delightful to behold, of fine complexion, and supreme in all regards.

source: དེ་ལ་བུད་མེད་གང་དང་གང་དག་གི་མིག་གིས་མཐོང་བའི་བུད་མེད་དེ་དང་དེ་དག་ཉིད་ཉོན་མོངས་པའི་འབྲས་བུ་དང་ལས་ཀྱི་འབྲས་བུ་ཡང་དག་པར་ཤེས་སོ། །
en: Whenever the king gazed at any of the ladies they would comprehend the effects of the afflictions and karma as related to their own particular situations.

source: དེ་དག་ཉོན་མོངས་པའི་འབྲས་བུ་དང་། ལས་ཀྱི་འབྲས་བུ་རིག་ནས་ཉོན་མོངས་པ་ཐམས་ཅད་ནས་ཐམས་ཅད་དུ་མི་སྐྱེ་ཞིང་། སྨད་པ་དེ་དག་ཀྱང་ཉེ་བར་ཤེས་པར་གྱུར་ཏོ། །
en: Thus, being aware of the effect of affliction and karma, they would always despise the afflictions and make sure that they did not develop any.

source: དེས་བུད་མེད་ཁྲི་ཕྲག་དགུ་བཅུ་པོ་དག་བདག་གི་ལས་དང་། བདག་གི་ཉོན་མོངས་པ་ཁོང་དུ་ཆུད་པར་བྱས་སོ། །
en: In this way, the king caused the nine hundred thousand women to understand their own karma and afflictions.

source: དེ་བདག་གི་ལས་དང་བདག་གི་ཉོན་མོངས་པ་དེ་དག་ཡོངས་སུ་ཤེས་པ་ན། འདོད་པ་རྣམས་ལ་འདོད་ཆགས་དང་བྲལ་བ་རྗེས་སུ་ཐོབ་བོ། །
en: With knowledge of their karma and afflictions they attained freedom from the craving for objects of desire.

source: དེ་དག་ལུས་ཞིག་ནས་ཤི་བའི་འོག་ཏུ་ཚངས་པའི་འཇིག་རྟེན་དུ་སྐྱེས་སོ། །
en: Once their bodies came to an end, they were born in the realm of Brahmā.

source: མཽད་གལ་གྱི་བུ་ཁྱོད་དེའི་ཚེ་དེའི་དུས་ན་རྒྱལ་པོ་ཉོན་མོངས་པ་སྨོད་པ་ཞེས་བྱ་བར་གྱུར་པ་དེ་གཞན་ཡིན་པར་སེམས་ན་ཁྱོད་ཀྱིས་དེ་ལྟར་མི་བལྟ་སྟེ
en: “Maudgalyāyana, in case you may think that at that time King Condemner of the Afflictions was anyone else, do not think so.

source: ང་དེའི་ཚེ་དེའི་དུས་ན་རྒྱལ་པོ་ཉོན་མོངས་པ་སྨོད་པ་ཞེས་བྱ་བར་གྱུར་ཏོ། །
en: In those days I was King Condemner of the Afflictions.

source: ངས་དེའི་ཚེ་བུད་མེད་ཁྲི་ཕྲག་དགུ་བཅུ་པོ་དེ་དག་ལས་དང་ཉོན་མོངས་པ་ཁོང་དུ་ཆུད་པར་བྱས་སོ། །
en: I caused those nine hundred thousand women to comprehend karma and affliction.

source: ཁོང་དུ་ཆུད་པ་ན་ལས་དང་ཉོན་མོངས་པ་ཡོངས་སུ་ཤེས་ནས་ཚངས་པའི་འཇིག་རྟེན་དུ་སྐྱེས་སོ། །
en: With knowledge of karma and affliction they were then reborn in the realm of Brahmā.

source: མཽད་གལ་གྱི་བུ་དེ་ལྟ་བས་ན་བྱང་ཆུབ་སེམས་དཔའ་ཉོན་མོངས་པ་སྤང་བར་བྱའོ།། །།
en: Therefore, Maudgalyāyana, bodhisattvas must relinquish the afflictions.

source: མཽད་གལ་གྱི་བུ་ངས་རིམ་པ་ཤེས་པ་འགོག་པ་ཤེས་པར་བྱ་བའི་དོན་དུ་སྔོན་བྱང་ཆུབ་སེམས་དཔའི་སྤྱད་པ་སྤྱོད་པ་ནས་དེ་བཞིན་དུ་སྦྱར་ཏེ། མངོན་པར་འདུས་བྱས་པའི་བར་དུའོ། །
en: “Maudgalyāyana, when I was training in the practices of a bodhisattva in the past, I created boundless roots of virtue in order to understand cessation as related to knowledge of the levels. I did this by wondering how I could fully awaken to unsurpassed and perfect buddhahood and then teach sentient beings about the knowledge of cessation as related to knowledge of the levels.

source: མཽད་གལ་གྱི་བུ་སྔོན་བྱུང་བ་འདས་པའི་དུས་འཁོར་བ་དཔག་ཏུ་མེད་པ་ནས། དེའི་ཕ་རོལ་གྱི་ཡང་ཆེས་ཕ་རོལ་ན། རྒྱལ་པོ་འགོག་པ་མཐོང་བ་ཞེས་བྱ་བ་ཞིག་བྱུང་ངོ་། །
en: “Long ago in the limitless cycle of existence, Maudgalyāyana, long before even the distant past there was a king known as Seer of Cessation.

source: དེ་ཆོས་སྐྱེ་བ་གང་དང་གང་མཐོང་བ་དེ་དང་དེ་ཉིད་ལ་འགོག་པར་རྣམ་པར་རྟོག་གོ། །
en: Whenever this king witnessed the arising of some phenomenon he would also understand its cessation.

source: དངོས་པོ་གང་དག་ཀུན་འབྱུང་བའི་ཆོས་ཅན་དེ་དག་ཐམས་ཅད་ནི་འགོག་པའི་ཆོས་ཅན་ནོ། །
en: ‘Whatever is subject to origination is also subject to cessation.

source: འབྱོར་པ་ཡང་འགོག་པའི་ཆོས་ཅན་ཡིན་ལ། རྒུད་པ་ཡང་འགོག་པའི་ཆོས་ཅན་ནོ། །
en: Wealth is subject to cessation, and so is destitution.

source: རྙེད་པ་ཡང་འགོག་པའི་ཆོས་ཅན་ཡིན་ལ། མ་རྙེད་པ་ཡང་འགོག་པའི་ཆོས་ཅན་ནོ། །
en: Acquisition is subject to destruction, and so is loss.

source: དེ་བཞིན་དུ་སྦྱར་ཏེ་གྲགས་པ་དང་། མ་གྲགས་པ་དང་། སྨད་པ་དང་། བསྟོད་པ་དང་། བདེ་བ་དང་། སྡུག་བསྔལ་བ་ཡང་འགོག་པའི་ཆོས་ཅན་ནོ་སྙམ་མོ། །
en: The same goes for fame and obscurity, praise and blame, pleasure and pain—all are subject to cessation.

source: ཆོས་འདི་དག་མངོན་པར་འདུས་མ་བྱས་ན་མི་སྐྱེ་སྟེ།
en: However, if none of these phenomena are created, none of them will arise.

source: གང་འགོག་པའི་ཆོས་ཅན་འདི་དག་ཐམས་ཅད་དེ་ཅི་སྟེ་མངོན་པར་བསྐྱེད་པར་བྱ།
en: Why, then, should we produce all these things that are subject to cessation.

source: གང་སྐྱེ་བ་མེད་པ་དེ་ལ་འགོག་པ་མེད། གང་འགོག་པ་མེད་པ་དེ་ལ་མྱ་ངན་མེད་ཅིང་སྨྲེ་སྔགས་འདོན་པ་མེད་དོ། །
en: What does not arise will not cease, and what does not cease is beyond suffering and lamentation.

source: དེ་ལྟ་བས་ན་མ་བྱས་པ་ཉིད་མཆོག་ཡིན་ནོ་སྙམ་མོ། །
en: Supreme, therefore, is that which was not made!’

source: མཽད་གལ་གྱི་བུ་དེ་ཇི་སྙམ་དུ་སེམས། དེའི་ཚེ་དེའི་དུས་ན་རྒྱལ་པོ་འགོག་པ་མཐོང་བ་ཞེས་བྱ་བར་གྱུར་པ་དེ་གཞན་ཡིན་པར་སེམས་ན་ཁྱོད་ཀྱིས་དེ་ལྟར་མི་བལྟ་སྟེ
en: “Maudgalyāyana, in case you may think that at that time King Seer of Cessation was anyone else, do not think so.

source: ང་དེའི་ཚེ་དེའི་དུས་ན་རྒྱལ་པོ་འགོག་པ་མཐོང་བ་ཞེས་བྱ་བར་གྱུར་ཏེ།
en: In those days I was King Seer of Cessation.

source: དེ་ང་ཡིན་ཏེ་ད་ལྟར་བྱུང་བའི་ཆོས་ཀྱང་འགོག་པའི་ཆོས་སུ་རབ་ཏུ་ཤེས་སོ། །
en: I was that king, and also now I remain fully aware that arising phenomena are subject to cessation.

source: ཀྱེ་མ་འཇིག་རྟེན་གནས་པ་འདི་ནི་འགོག་པའི་ཆོས་དང་། ཆོས་རྣམས་ལ་སྤྱོད་པ་ཉོན་མོངས་སོ་སྙམ་མོ། །
en: ‘Alas, this present world is subject to cessation, and involvement in these phenomena is affliction.’

source: དེ་ང་ཡིན་ཏེ་སྐྱེ་བོའི་ཚོགས་མང་པོའི་ནང་དུ་འདུག་ནས་ཆོས་ཐམས་ཅད་ནི་འགོག་པའི་ཆོས་སོ་ཞེས་ཆོས་བསྟན་ཏོ། །
en: I am the one who in the midst of many beings taught the Dharma by showing all phenomena to be subject to destruction.

source: དེས་ན་ངས་སྔོན་སྲོག་ཆགས་ཁྲི་ཕྲག་དཔག་ཏུ་མེད་པ་དག་མངོན་པར་འདུ་བྱེད་པ་མེད་པ་ལ་རབ་ཏུ་བཙུད་དོ། །
en: In this way I have guided innumerably many tens of thousands of beings to become free from karmic formation.

source: ལྷ་དང་མི་རྣམས་ལ་ཡང་དག་པར་རབ་ཏུ་བསྟན་ཏེ། ངའི་ཚངས་པར་སྤྱོད་པ་རྒྱ་ཆེ་བར་གྱུར་ཏོ། །
en: I have taught gods and humans correctly, and my pure conduct is immense.

source: མཽད་གལ་གྱི་བུ་དེ་ལྟ་བས་ན་བྱང་ཆུབ་སེམས་དཔས་འགོག་པ་ལ་མཁས་པར་བྱའོ། །
en: Therefore, Maudgalyāyana, bodhisattvas must become expert regarding cessation.

source: འགོག་པ་ལ་མཁས་པའི་བྱང་ཆུབ་སེམས་དཔའ་ནི་ཕྱིར་མི་ལྡོག་ཅིང་མྱུར་དུ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་འགྱུར་རོ། །
en: The bodhisattva who is an expert on cessation becomes irreversible and will quickly awaken to unsurpassed and perfect buddhahood.
